package oop.ch07.v04.multiInterface;

public class MultiInterfaceEx1 {

	/*
	 * 
	 *   1. 여러 개의 인터페이스 구현하기 
	 *   
	 *     - 인터페이스는 구현 코드가 없으므로 하나의 클래스가 여러 인터페이스를 구현할 수 있다. (다중 상속은 불가능)
	 *     
	 *     - 디폴트 메서드(구현 코드가 존재)의 이름이 중복 되는 경우에는 재정의 함
	 *     
	 *     
	 *       	 Buy						Sell
	 *       (인터페이스)				(인터페이스)
	 *       	  ^							 ^
	 *       	  |							 |
	 *       	  |							 |
	 *            ----------------------------
	 *            				|
	 *            				|
	 *            			Customer
	 *            		(실제 구현 클래스)
	 *       
	 *            
	 */
	
}
