package oop.ch02.v05.cooperation;

public class CoorperationBtwnObject {

	/*
	 * 
	 * 객체 간 협력
	 * 
	 *   - 객체 지향 프로그램은 객체를 정의하고 객체 간의 협력을 구현한 프로그램
	 *   - 학생이 지하철이나 버스를 타고 학교 가는 과정에서 일어나는 협력
	 *   
	 *     학생
	 *       - 이름
	 *       - 학년
	 *       - 가진 돈
	 *       
	 *     버스
	 *       - 버스 번호
	 *       - 승객 수
	 *       - 수입
	 *       
	 *     지하철
	 *       - 노선 번호
	 *       - 승객 수
	 *       - 수입
	 *       
	 *     학생->버스 : 버스를 탄다.
	 *     학생->지하철 : 지하철을 탄다.
	 *     
	 *   - 학생, 버스, 지하철에 대한 각각의 클래스를 만들고, "탄다" 라는 행위가 있을 떄 무슨 일이 발생(요금지불, 승객 수 증가 등)하는 지 확인
	 *   
	 * 
	 */
	
}
