package oop.ch07.v03.interfaceComponents;

public class InterfaceComponentsEx1 {

	/*
	 * 
	 *   1. 인터페이스의 요소 
	 *   
	 *     1.1 상수
	 *     
	 *       - 선언된 모든 변수는 상수로 처리됨
	 *   
	 *       
	 *     1.2 메서드
	 *     
	 *       - 모든 메서드는 추상 메서드
	 *       
	 *       
	 *     1.3 디폴트 메서드
	 *     
	 *       - 기본 구현을 가지는 메서드 
	 *       
	 *       - 구현하는 클래스에서 재정의할 수 있음 (java 8)
	 *       
	 *     
	 *     1.4 정적(static) 메서드
	 *     
	 *       - 인스턴스 생성과 상관없이 인터페이스 타입으로 호출하는 메서드 (java 8)
	 *       
	 *     
	 *     1.5 private 메서드
	 *     
	 *       - 인터페이스 내에서 사용하기 위해 구현한 메서드
	 *       
	 *       - 구현하는 클래스에서 재정의할 수 없음 (java 9)
	 *   
	 *            
	 */
	
}
